#include <locale.h>
#include <stdio.h>
void main()
{
	// задание 1
	setlocale(LC_CTYPE, "RUS");
	puts("<><><><><><><><><><><><><><><><><><><><><><><><><>");
	puts("<>                                              <>");
	puts("<> тема: Разработка консольного приложения      <>");
	puts("<>    Выполнил Лукьянов В.А.                    <>");
	puts("<>                                              <>");
	puts("<><><><><><><><><><><><><><><><><><><><><><><><><>");
	// задание 2
	puts("   ___  ___  ___  ___  ___ ");
	puts(" | |__| |  | |__| |  | |__ ");
	puts(" |  __| |__|  __| |__| |__| ");
	// задание 3
	puts("                /L        ");
	puts("               /  L       ");
	puts("              /    L      ");
	puts("             /______L     ");
	puts("             |      |     ");
	puts("             | ___  |     ");
	puts("             | |.|  |     ");
	puts("             |_| |__|     ");
}