#include <stdio.h>
#include <locale.h>
int N, K, n, L, K;
void main()
{
	// задание 1
	setlocale (LC_ALL, "RUS");
	printf("123\n");
	printf("\n1\n2\n3");
	printf("\n\n1\n\t2\n\t\t3");
	printf("\n\t%d\n\t\t%d\n\t\t\t%d",1 ,2 ,3 ,4);
	printf("\n%10.3f\n", 12.234657);
	printf("\n%10.5f\n", 12.234657);
	printf("\nОстаток от деления %d на %d равен %d\n",5 ,2, 5%2);
	printf("\nДеление %d на %d равен %d , а остаток %d\n ", 7, 5, 7/5, 7%5);
	printf("\nУмножение %d на %d равен %d\n",2000, 4, 2000*4 );
	printf("\n%g разделить %e равно %f\n", 5., 2., 5./2.);
	printf("\n%d разделить %d равно %d\n", 5., 2., 5. / 2.);
	printf("\n%f разделить %f равно %f\n", 5., 2., 5. / 2.);
	printf("\n%g разделить %g равно %g\n", 5., 2., 5. / 2.);
	printf("\n%e разделить %e равно %e\n", 5., 2., 5. / 2.);
	// задание 2
	N = 16;
	K = 34;
	printf("Сейчас %d часов %d минут 00 секунд\n", N,K);
	printf("Идёт %d минута суток\n",N*60+K);
	printf("До полуночи осталось %d часов и %d минут\n", 23-N, 60-K);
	printf("С 8.00 прошло %d секунд\n", (((N-8)*3600)+K*60));
	printf("Текущий час = %f суток и текущая минуты = %f часа\n",16./24, 34./60);
	// задание 3 (12 вариант)
	L = 433;
	n = 4;
	printf("\nДано:  \n\t%.3d \n\t%.3d\n", n, L);
	printf("\n\t---------\n");
	float k;
	k = n / L;
	printf("Ответ:  \n\t%+3.3f", k);


}